In [2]:
import numpy as np

In [3]:
import numpy as np
a=np.array([1,2,3,4,5],dtype="float")
a

array([1., 2., 3., 4., 5.])

In [4]:
import numpy as np
a=np.array((1,2,3,4,5),dtype="float")
a

array([1., 2., 3., 4., 5.])

## pandas
- It is a important module in data science library
- stands for pannel data
- data structures
  - series
  - dataframes
- which is we can do the data analysis,manipulations, cleaning
- data analysation
  - stastics of the data
  - volume of the data
- data manuplation
  - changing data from one form to another
  - merging,concatenation and join ...etc!
- data cleaning
  - removing unwanted data
  - deleted null values and nan values....etc!

In [5]:
import pandas as pd

In [6]:
import pandas as pd
pd.__version__

'0.23.4'

In [7]:
# we can create the pandas series with list,string, tuple,dictionary
print(dir(pd))

['Categorical', 'CategoricalIndex', 'DataFrame', 'DateOffset', 'DatetimeIndex', 'ExcelFile', 'ExcelWriter', 'Expr', 'Float64Index', 'Grouper', 'HDFStore', 'Index', 'IndexSlice', 'Int64Index', 'Interval', 'IntervalIndex', 'MultiIndex', 'NaT', 'Panel', 'Period', 'PeriodIndex', 'RangeIndex', 'Series', 'SparseArray', 'SparseDataFrame', 'SparseSeries', 'Term', 'TimeGrouper', 'Timedelta', 'TimedeltaIndex', 'Timestamp', 'UInt64Index', 'WidePanel', '_DeprecatedModule', '__builtins__', '__cached__', '__doc__', '__docformat__', '__file__', '__loader__', '__name__', '__package__', '__path__', '__spec__', '__version__', '_hashtable', '_lib', '_libs', '_np_version_under1p10', '_np_version_under1p11', '_np_version_under1p12', '_np_version_under1p13', '_np_version_under1p14', '_np_version_under1p15', '_tslib', '_version', 'api', 'bdate_range', 'compat', 'concat', 'core', 'crosstab', 'cut', 'date_range', 'datetime', 'datetools', 'describe_option', 'errors', 'eval', 'factorize', 'get_dummies', 'get_option', 'get_store', 'groupby', 'infer_freq', 'interval_range', 'io', 'isna', 'isnull', 'json', 'lib', 'lreshape', 'match', 'melt', 'merge', 'merge_asof', 'merge_ordered', 'notna', 'notnull', 'np', 'offsets', 'option_context', 'options', 'pandas', 'parser', 'period_range', 'pivot', 'pivot_table', 'plot_params', 'plotting', 'pnow', 'qcut', 'read_clipboard', 'read_csv', 'read_excel', 'read_feather', 'read_fwf', 'read_gbq', 'read_hdf', 'read_html', 'read_json', 'read_msgpack', 'read_parquet', 'read_pickle', 'read_sas', 'read_sql', 'read_sql_query', 'read_sql_table', 'read_stata', 'read_table', 'reset_option', 'scatter_matrix', 'set_eng_float_format', 'set_option', 'show_versions', 'test', 'testing', 'timedelta_range', 'to_datetime', 'to_msgpack', 'to_numeric', 'to_pickle', 'to_timedelta', 'tools', 'tseries', 'tslib', 'unique', 'util', 'value_counts', 'wide_to_long']

In [8]:
#how to create pandas series with
a=pd.Series("i am from vizianagaram")
a

0    i am from vizianagaram
dtype: object

In [9]:
b=input()
c=pd.Series(b)
c

hy gf gh

0    hy gf gh
dtype: object

In [12]:
b=input()
c=pd.Series(b.split(" "))
c

hyy ju nh

0    hyy
1     ju
2     nh
dtype: object

In [11]:
t=(4,5,6,8,7)
t1=pd.Series(t)
t1

0    4
1    5
2    6
3    8
4    7
dtype: int64

In [13]:
d=pd.Series(range(20,26))
d

0    20
1    21
2    22
3    23
4    24
5    25
dtype: int64

In [16]:
dic={"list":[1,2,3],"tuple":(3,4,5),'string':"hii","int":123}
dic

{'list': [1, 2, 3], 'tuple': (3, 4, 5), 'string': 'hii', 'int': 123}

In [17]:
dict1=pd.Series(dic)
dict1

list      [1, 2, 3]
tuple     (3, 4, 5)
string          hii
int             123
dtype: object

In [18]:
dict1.index

Index(['list', 'tuple', 'string', 'int'], dtype='object')

In [20]:
import numpy as np
arr=np.arange(10,50,5)
arr1=pd.Series(arr)
arr1

0    10
1    15
2    20
3    25
4    30
5    35
6    40
7    45
dtype: int32

In [21]:
arr1[0]

10

In [22]:
len(arr1)

8

In [23]:
arr1[len(arr1)-1]

45

In [24]:
arr1[0:2]

0    10
1    15
dtype: int32

In [25]:
arr1.index

RangeIndex(start=0, stop=8, step=1)

In [26]:
arr1.index=[223,122,122,3344,2334,123,456,789]
arr1

223     10
122     15
122     20
3344    25
2334    30
123     35
456     40
789     45
dtype: int32

In [27]:
li=["hi",'hello',"good","hope"]
pd.Series(li,index=(1,2,3,4))

1       hi
2    hello
3     good
4     hope
dtype: object

In [29]:
li=["hi","hello","good","hope"]
ind=[i for i in range(15,19)]
pd.Series(li,index=ind)

15       hi
16    hello
17     good
18     hope
dtype: object

In [32]:
dict2=pd.Series(dic,index=ind)
dict2

15    NaN
16    NaN
17    NaN
18    NaN
dtype: object

In [33]:
dict2.index

Int64Index([15, 16, 17, 18], dtype='int64')

In [ ]:
###  data frames
- data  is in 2d forrmate

In [50]:
import  pandas as pd
import numpy as np
pd.DataFrame(dic)# it has row and columing

   list  tuple string  int
0     1      3    hii  123
1     2      4    hii  123
2     3      5    hii  123

In [35]:
data={56:"fiftysix","float":10.23,"prgm":"workshop","name":"da"}
data

{56: 'fiftysix', 'float': 10.23, 'prgm': 'workshop', 'name': 'da'}

In [55]:
 df2

             56  float      prgm name
i      fiftysix  10.23  workshop   da
am     fiftysix  10.23  workshop   da
in     fiftysix  10.23  workshop   da
vrsec  fiftysix  10.23  workshop   da

In [51]:
df1=pd.DataFrame(dic)
df1

   list  tuple string  int
0     1      3    hii  123
1     2      4    hii  123
2     3      5    hii  123

In [56]:
 df2=pd.DataFrame(data,index="i am in vrsec".split(" "))

In [58]:
pd.concat([df1,df2])

C:\ProgramData\Anaconda3\lib\site-packages\ipykernel_launcher.py:1: FutureWarning: Sorting because non-concatenation axis is not aligned. A future version
of pandas will change to not sort by default.

To accept the future behavior, pass 'sort=False'.

To retain the current behavior and silence the warning, pass 'sort=True'.

  """Entry point for launching an IPython kernel.

         int  list string  tuple        56  float      prgm name
0      123.0   1.0    hii    3.0       NaN    NaN       NaN  NaN
1      123.0   2.0    hii    4.0       NaN    NaN       NaN  NaN
2      123.0   3.0    hii    5.0       NaN    NaN       NaN  NaN
i        NaN   NaN    NaN    NaN  fiftysix  10.23  workshop   da
am       NaN   NaN    NaN    NaN  fiftysix  10.23  workshop   da
in       NaN   NaN    NaN    NaN  fiftysix  10.23  workshop   da
vrsec    NaN   NaN    NaN    NaN  fiftysix  10.23  workshop   da

In [60]:
dict3={"first":[1,2,3,4],"second":[5,6,7,8],"third":(24,34,57,68)}
dict3

{'first': [1, 2, 3, 4], 'second': [5, 6, 7, 8], 'third': (24, 34, 57, 68)}

In [61]:
df3=pd.DataFrame(dict3,index=[2001,2002,2003,2004])
df3

      first  second  third
2001      1       5     24
2002      2       6     34
2003      3       7     57
2004      4       8     68

In [64]:
df4=pd.DataFrame({"fourth":[1,2,3,4],"fifth":[5,6,7,8],"sixth":(24,34,57,68)})
df4

   fourth  fifth  sixth
0       1      5     24
1       2      6     34
2       3      7     57
3       4      8     68

In [ ]:
df4=pd.DataFrame({"fourth":[34,24,44,56],"fifth":[11,21,31,41],"sixth":[13,14,15,16])},index[]

In [65]:
df3.join(df4)

      first  second  third  fourth  fifth  sixth
2001      1       5     24     NaN    NaN    NaN
2002      2       6     34     NaN    NaN    NaN
2003      3       7     57     NaN    NaN    NaN
2004      4       8     68     NaN    NaN    NaN

In [66]:
df4.join(df3)

   fourth  fifth  sixth  first  second  third
0       1      5     24    NaN     NaN    NaN
1       2      6     34    NaN     NaN    NaN
2       3      7     57    NaN     NaN    NaN
3       4      8     68    NaN     NaN    NaN

In [77]:
df5=pd.DataFrame({"a":[78,89,56,23],"b":(65,80,34,45),"c":[67,89,45,23]},index="these are integers values".split(" "))
df5

           a   b   c
these     78  65  67
are       89  80  89
integers  56  34  45
values    23  45  23

In [78]:
df6=pd.DataFrame({"a":[78,189,156,123],"b":(65,810,344,45),"c":[67,829,425,223]},index="these are integers values".split(" "))
df6

            a    b    c
these      78   65   67
are       189  810  829
integers  156  344  425
values    123   45  223

In [79]:
df6.merge(df5)

    a   b   c
0  78  65  67

In [80]:
df6.merge(df5,on="c")

   a_x  b_x   c  a_y  b_y
0   78   65  67   78   65

In [5]:
import pandas as pd
df5=pd.DataFrame({"a":[78,89,56,23],"b":(65,80,34,45),"c":[67,89,45,23]},index="these are integers values".split(" "))
df5

           a   b   c
these     78  65  67
are       89  80  89
integers  56  34  45
values    23  45  23

In [8]:
df6=pd.DataFrame({"a":[78,189,156,123],"b":(65,810,344,45),"c":[67,829,425,223]},index="these are integers values".split(" "))
df6

            a    b    c
these      78   65   67
are       189  810  829
integers  156  344  425
values    123   45  223

In [ ]:
import pandas as pd

In [19]:
df4=pd.DataFrame({"fourth":[1,2,3,4],"fifth":[5,6,7,8],"sixth":(24,34,57,68)})
df4

   fourth  fifth  sixth
0       1      5     24
1       2      6     34
2       3      7     57
3       4      8     68

In [ ]:
df5=pd.DataFrame({"a":[78,89,56,23],"b":(65,80,34,45),"c":[67,89,45,23]},index="these are integers values".split(" "))
df5

In [9]:
#help(df6.merge)
new=df5.merge(df6)
new.columns=["ab","ba","cb"]
new.index(20,30)
new

TypeError: 'Int64Index' object is not callable

In [10]:
dt=pd.date_range('2022-01-01','2022-02-15',periods=6)
dt

DatetimeIndex(['2022-01-01', '2022-01-10', '2022-01-19', '2022-01-28',
               '2022-02-06', '2022-02-15'],
              dtype='datetime64[ns]', freq=None)

In [11]:
dt=pd.date_range('2022-01-01','2022-02-15',periods=6)
pd.Series(dt)

0   2022-01-01
1   2022-01-10
2   2022-01-19
3   2022-01-28
4   2022-02-06
5   2022-02-15
dtype: datetime64[ns]

In [21]:
temp=[34,23,15,56,7,8]
dt4=pd.Series(temp,index=dt)

In [22]:
df4=pd.DataFrame({"fourth":[1,2,3,4],"fifth":[5,6,7,8],"sixth":(24,34,57,68)})
df4

   fourth  fifth  sixth
0       1      5     24
1       2      6     34
2       3      7     57
3       4      8     68

In [24]:
temp=[34,23,15,56,7,8]
dt4=pd.Series(temp,index=dt)

In [27]:
dt4["2022-01-10"]

23

###  working with .csv files
- reading .csv files with "read_csv()"method.
- syntax:- pd.read__csv("file location")

In [48]:
#reading data
data=pd.read_csv("sandy.csv")
data

   Roll Name  Maths  Discrete  OS    CO    DS
0    A1    X     60        70  30  70.0  90.0
1    A2    Y     90        45  67  73.0  50.0
2    A1    G     60        70  30   NaN  90.0
3    A2    H     40        60  73  50.0   NaN
4    B1    I     50        70  90  90.0   NaN
5    B2    J     63        45  67  56.0  50.0
6    C1    K     67        70  30  75.0  40.0
7    C2    L     91        45  67  72.0  50.0
8    D1    M     40        70  50   NaN  90.0
9    D2    N      5        67  65  50.0   NaN
10   E1    X     50        70  30  80.0  90.0
11   E2    Y     60        45  77  73.0  40.0

In [50]:
#sample
data.sample()

  Roll Name  Maths  Discrete  OS  CO    DS
8   D1    M     40        70  50 NaN  90.0

In [51]:
data.sample()

   Roll Name  Maths  Discrete  OS    CO    DS
11   E2    Y     60        45  77  73.0  40.0

In [52]:
data.sample(3)

   Roll Name  Maths  Discrete  OS    CO    DS
11   E2    Y     60        45  77  73.0  40.0
2    A1    G     60        70  30   NaN  90.0
0    A1    X     60        70  30  70.0  90.0

In [53]:
data.head()

  Roll Name  Maths  Discrete  OS    CO    DS
0   A1    X     60        70  30  70.0  90.0
1   A2    Y     90        45  67  73.0  50.0
2   A1    G     60        70  30   NaN  90.0
3   A2    H     40        60  73  50.0   NaN
4   B1    I     50        70  90  90.0   NaN

In [54]:
data.head(3)#customize

  Roll Name  Maths  Discrete  OS    CO    DS
0   A1    X     60        70  30  70.0  90.0
1   A2    Y     90        45  67  73.0  50.0
2   A1    G     60        70  30   NaN  90.0

In [55]:
#tail-opposite to head returns bottom values of the table
data.tail()

   Roll Name  Maths  Discrete  OS    CO    DS
7    C2    L     91        45  67  72.0  50.0
8    D1    M     40        70  50   NaN  90.0
9    D2    N      5        67  65  50.0   NaN
10   E1    X     50        70  30  80.0  90.0
11   E2    Y     60        45  77  73.0  40.0

In [56]:
data.tail(2)

   Roll Name  Maths  Discrete  OS    CO    DS
10   E1    X     50        70  30  80.0  90.0
11   E2    Y     60        45  77  73.0  40.0

In [57]:
data["Roll"]#accessing a single col data

0     A1
1     A2
2     A1
3     A2
4     B1
5     B2
6     C1
7     C2
8     D1
9     D2
10    E1
11    E2
Name: Roll, dtype: object

In [59]:
data[["Maths","Discrete","OS"]]#accesing multiple columns values

    Maths  Discrete  OS
0      60        70  30
1      90        45  67
2      60        70  30
3      40        60  73
4      50        70  90
5      63        45  67
6      67        70  30
7      91        45  67
8      40        70  50
9       5        67  65
10     50        70  30
11     60        45  77

In [ ]:
new=pd.read_csv("marks.csv",usecols=["Name","Maths"])

In [64]:
new

   ab  ba  cb
0  78  65  67

In [65]:
data.columns

Index(['Roll', 'Name', 'Maths', 'Discrete', 'OS', 'CO', 'DS'], dtype='object')

In [66]:
data.index

RangeIndex(start=0, stop=12, step=1)

In [67]:
data.dtypes

Roll         object
Name         object
Maths         int64
Discrete      int64
OS            int64
CO          float64
DS          float64
dtype: object

In [68]:
data.info#textual info like priting

<bound method DataFrame.info of    Roll Name  Maths  Discrete  OS    CO    DS
0    A1    X     60        70  30  70.0  90.0
1    A2    Y     90        45  67  73.0  50.0
2    A1    G     60        70  30   NaN  90.0
3    A2    H     40        60  73  50.0   NaN
4    B1    I     50        70  90  90.0   NaN
5    B2    J     63        45  67  56.0  50.0
6    C1    K     67        70  30  75.0  40.0
7    C2    L     91        45  67  72.0  50.0
8    D1    M     40        70  50   NaN  90.0
9    D2    N      5        67  65  50.0   NaN
10   E1    X     50        70  30  80.0  90.0
11   E2    Y     60        45  77  73.0  40.0>

In [69]:
data.describe()

           Maths   Discrete         OS         CO         DS
count  12.000000  12.000000  12.000000  10.000000   9.000000
mean   56.333333  60.583333  56.333333  68.900000  65.555556
std    22.928083  11.851032  21.465970  13.042239  23.511227
min     5.000000  45.000000  30.000000  50.000000  40.000000
25%    47.500000  45.000000  30.000000  59.500000  50.000000
50%    60.000000  68.500000  66.000000  72.500000  50.000000
75%    64.000000  70.000000  68.500000  74.500000  90.000000
max    91.000000  70.000000  90.000000  90.000000  90.000000

In [71]:
data.Maths.value_counts()#to get frequency of values of a particular value

60    3
40    2
50    2
63    1
91    1
90    1
5     1
67    1
Name: Maths, dtype: int64

In [72]:
data["Maths"].value_counts()

60    3
40    2
50    2
63    1
91    1
90    1
5     1
67    1
Name: Maths, dtype: int64

In [73]:
data.shape

(12, 7)

In [75]:
data.sort_values("Maths")

   Roll Name  Maths  Discrete  OS    CO    DS
9    D2    N      5        67  65  50.0   NaN
3    A2    H     40        60  73  50.0   NaN
8    D1    M     40        70  50   NaN  90.0
4    B1    I     50        70  90  90.0   NaN
10   E1    X     50        70  30  80.0  90.0
0    A1    X     60        70  30  70.0  90.0
2    A1    G     60        70  30   NaN  90.0
11   E2    Y     60        45  77  73.0  40.0
5    B2    J     63        45  67  56.0  50.0
6    C1    K     67        70  30  75.0  40.0
1    A2    Y     90        45  67  73.0  50.0
7    C2    L     91        45  67  72.0  50.0

In [76]:
data.sort_values("Roll",ascending=False)

   Roll Name  Maths  Discrete  OS    CO    DS
11   E2    Y     60        45  77  73.0  40.0
10   E1    X     50        70  30  80.0  90.0
9    D2    N      5        67  65  50.0   NaN
8    D1    M     40        70  50   NaN  90.0
7    C2    L     91        45  67  72.0  50.0
6    C1    K     67        70  30  75.0  40.0
5    B2    J     63        45  67  56.0  50.0
4    B1    I     50        70  90  90.0   NaN
1    A2    Y     90        45  67  73.0  50.0
3    A2    H     40        60  73  50.0   NaN
0    A1    X     60        70  30  70.0  90.0
2    A1    G     60        70  30   NaN  90.0

In [78]:
data["Total"]=100
data

   Roll Name  Maths  Discrete  OS    CO    DS  Total
0    A1    X     60        70  30  70.0  90.0    100
1    A2    Y     90        45  67  73.0  50.0    100
2    A1    G     60        70  30   NaN  90.0    100
3    A2    H     40        60  73  50.0   NaN    100
4    B1    I     50        70  90  90.0   NaN    100
5    B2    J     63        45  67  56.0  50.0    100
6    C1    K     67        70  30  75.0  40.0    100
7    C2    L     91        45  67  72.0  50.0    100
8    D1    M     40        70  50   NaN  90.0    100
9    D2    N      5        67  65  50.0   NaN    100
10   E1    X     50        70  30  80.0  90.0    100
11   E2    Y     60        45  77  73.0  40.0    100

In [79]:
data.Maths.sum()

676

In [88]:
data.CO.sum()

689.0

In [89]:
data.isnull()

     Roll   Name  Maths  Discrete     OS     CO     DS  Total
0   False  False  False     False  False  False  False  False
1   False  False  False     False  False  False  False  False
2   False  False  False     False  False   True  False  False
3   False  False  False     False  False  False   True  False
4   False  False  False     False  False  False   True  False
5   False  False  False     False  False  False  False  False
6   False  False  False     False  False  False  False  False
7   False  False  False     False  False  False  False  False
8   False  False  False     False  False   True  False  False
9   False  False  False     False  False  False   True  False
10  False  False  False     False  False  False  False  False
11  False  False  False     False  False  False  False  False

In [90]:
data.isna()

     Roll   Name  Maths  Discrete     OS     CO     DS  Total
0   False  False  False     False  False  False  False  False
1   False  False  False     False  False  False  False  False
2   False  False  False     False  False   True  False  False
3   False  False  False     False  False  False   True  False
4   False  False  False     False  False  False   True  False
5   False  False  False     False  False  False  False  False
6   False  False  False     False  False  False  False  False
7   False  False  False     False  False  False  False  False
8   False  False  False     False  False   True  False  False
9   False  False  False     False  False  False   True  False
10  False  False  False     False  False  False  False  False
11  False  False  False     False  False  False  False  False

In [91]:
data.isnull().sum()#Null values

Roll        0
Name        0
Maths       0
Discrete    0
OS          0
CO          2
DS          3
Total       0
dtype: int64

In [92]:
data.nunique()#to get unique values count  in each

Roll        10
Name        10
Maths        8
Discrete     4
OS           7
CO           8
DS           3
Total        1
dtype: int64

In [93]:
clean=data.dropna()
clean

   Roll Name  Maths  Discrete  OS    CO    DS  Total
0    A1    X     60        70  30  70.0  90.0    100
1    A2    Y     90        45  67  73.0  50.0    100
5    B2    J     63        45  67  56.0  50.0    100
6    C1    K     67        70  30  75.0  40.0    100
7    C2    L     91        45  67  72.0  50.0    100
10   E1    X     50        70  30  80.0  90.0    100
11   E2    Y     60        45  77  73.0  40.0    100

In [94]:
data

   Roll Name  Maths  Discrete  OS    CO    DS  Total
0    A1    X     60        70  30  70.0  90.0    100
1    A2    Y     90        45  67  73.0  50.0    100
2    A1    G     60        70  30   NaN  90.0    100
3    A2    H     40        60  73  50.0   NaN    100
4    B1    I     50        70  90  90.0   NaN    100
5    B2    J     63        45  67  56.0  50.0    100
6    C1    K     67        70  30  75.0  40.0    100
7    C2    L     91        45  67  72.0  50.0    100
8    D1    M     40        70  50   NaN  90.0    100
9    D2    N      5        67  65  50.0   NaN    100
10   E1    X     50        70  30  80.0  90.0    100
11   E2    Y     60        45  77  73.0  40.0    100